documents/images/graphio/stdlib/convert_color4_material_instance.dot
digraph {
  rankdir = LR;
    NG_convert_color4_material_surfacematerial [label= "surfacematerial"];
    NG_convert_color4_material_surfacematerial[shape = box];
    NG_convert_color4_material_surfacematerial ->     NG_convert_color4_material_out;
    NG_convert_color4_material_out [label= "out"];
    NG_convert_color4_material_out[shape = box]; 
    NG_convert_color4_material_surface_unlit [label= "surface_unlit"];
    NG_convert_color4_material_surface_unlit[shape = box];
    NG_convert_color4_material_surface_unlit ->     NG_convert_color4_material_surfacematerial [label= "surfaceshader"];
    NG_convert_color4_material_surfacematerial [label= "surfacematerial"];
    NG_convert_color4_material_surfacematerial[shape = box]; 
    NG_convert_color4_material_convert [label= "convert"];
    NG_convert_color4_material_convert[shape = box];
    NG_convert_color4_material_convert ->     NG_convert_color4_material_surface_unlit [label= "emission_color"];
    NG_convert_color4_material_surface_unlit [label= "surface_unlit"];
    NG_convert_color4_material_surface_unlit[shape = box]; 
    NG_convert_color4_material_inINT [label="in"];
    NG_convert_color4_material_inINT [shape = ellipse];
    NG_convert_color4_material_convert [label="convert"];
    NG_convert_color4_material_inINT -> NG_convert_color4_material_convert [label=".in"];
    NG_convert_color4_material_extract [label= "extract"];
    NG_convert_color4_material_extract[shape = box];
    NG_convert_color4_material_extract ->     NG_convert_color4_material_surface_unlit [label= "opacity"];
    NG_convert_color4_material_surface_unlit [label= "surface_unlit"];
    NG_convert_color4_material_surface_unlit[shape = box]; 
    NG_convert_color4_material_inINT [label="in"];
    NG_convert_color4_material_inINT [shape = ellipse];
    NG_convert_color4_material_extract [label="extract"];
    NG_convert_color4_material_inINT -> NG_convert_color4_material_extract [label=".in"];
}
